CSI API ETABS v1
cPropFrame.SetColdZ_1 Method
 Initializes a cold formed Z-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetColdZ_1(
	string Name,
	string MatProp,
	double T3,
	double T2,
	double Thickness,
	double Radius,
	double LipDepth,
	double LipAngle,
	bool MirrorAbout2,
	int Color = -1,
	string Notes = "",
	string GUID = ""
)
Function SetColdZ_1 (
	Name As String,
	MatProp As String,
	T3 As Double,
	T2 As Double,
	Thickness As Double,
	Radius As Double,
	LipDepth As Double,
	LipAngle As Double,
	MirrorAbout2 As Boolean,
	Optional Color As Integer = -1,
	Optional Notes As String = "",
	Optional GUID As String = ""
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim MatProp As String
Dim T3 As Double
Dim T2 As Double
Dim Thickness As Double
Dim Radius As Double
Dim LipDepth As Double
Dim LipAngle As Double
Dim MirrorAbout2 As Boolean
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetColdZ_1(Name,
	MatProp, T3, T2, Thickness, Radius,
	LipDepth, LipAngle, MirrorAbout2,
	Color, Notes, GUID)
int SetColdZ_1(
	String^ Name,
	String^ MatProp,
	double T3,
	double T2,
	double Thickness,
	double Radius,
	double LipDepth,
	double LipAngle,
	bool MirrorAbout2,
	int Color = -1,
	String^ Notes = L"",
	String^ GUID = L""
)
abstract SetColdZ_1 :
        Name : string *
        MatProp : string *
        T3 : float *
        T2 : float *
        Thickness : float *
        Radius : float *
        LipDepth : float *
        LipAngle : float *
        MirrorAbout2 : bool *
        ?Color : int *
        ?Notes : string *
        ?GUID : string
(* Defaults:
        let _Color = defaultArg Color -1
        let _Notes = defaultArg Notes ""
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing or new frame section property. If this is an existing property, that property is modified; otherwise, a new property is added.
MatProp
Type: System.String
 The name of the material property for the section.
T3
Type: System.Double
 The section depth. [L]
T2
Type: System.Double
 The section width. [L]
Thickness
Type: System.Double
 The section thickness. [L]
Radius
Type: System.Double
 The corner radius, if any. [L]
LipDepth
Type: System.Double
 The lip depth, if any. [L]
LipAngle
Type: System.Double
 The lip angle measured from horizontal (0 <= LipAngle <= 90). [deg]
MirrorAbout2
Type: System.Boolean
Indicates whether the section is mirrored about the local 2-axis.
Color (Optional)
Type: System.Int32
 The display color assigned to the section. If Color is specified as -1, the program will automatically assign a color.
Notes (Optional)
Type: System.String
 The notes, if any, assigned to the section.
GUID (Optional)
Type: System.String
 The GUID (global unique identifier), if any, assigned to the section. If this item is input as Default, then the program assigns a GUID to the section.
Return Value
Type: Int32
 Returns zero if the section property data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Name As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add cold formed material
       ret = SapModel.PropMaterial.AddQuick(Name, MATERIAL_COLDFORMED, , , , MATERIAL_COLDFORMED_SUBTYPE_ASTM_A653SQGr50)
   'set new frame section property
       ret = SapModel.PropFrame.SetColdZ_1("CH1", Name, 10, 3.2, 0.08, 0.3, 0.6, False)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace